Tekla Open API Reference for Tekla Structures 2025
CrossSection Methods
The CrossSection type exposes the following members.
Methods
Name | Description
GetInnerContours
 Gets the inner loop geometries as Polycurve.
GetOuterContour
 Gets the outer loop geometry as Polycurve.
Select(Double, Double)
 Selects the cross section from the profile definition.
Select(Boolean, Double, Double)
 Selects the cross section from the profile definition.
Top
See Also
Reference
CrossSection Class
Tekla.Structures.Catalogs Namespace